; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-6-1)
(:domain sobokosnake)
(:objects
    pos0-0 - location
    pos0-1 - location
    pos0-3 - location
    pos1-0 - location
    pos1-1 - location
    pos1-2 - location
    pos1-3 - location
    pos2-1 - location
    pos2-3 - location
    pos3-0 - location
    pos3-1 - location
    pos3-3 - location
    pos4-0 - location
    pos4-1 - location
    pos4-3 - location
    pos5-0 - location
    pos5-3 - location
    pos6-0 - location
    pos6-1 - location
    pos6-2 - location
    pos6-3 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-0 pos0-1 dir-right)
    (MOVE-DIR pos0-0 pos1-0 dir-down)
    (MOVE-DIR pos0-1 pos0-0 dir-left)
    (MOVE-DIR pos0-1 pos1-1 dir-down)
    (MOVE-DIR pos0-3 pos1-3 dir-down)
    (MOVE-DIR pos1-0 pos0-0 dir-up)
    (MOVE-DIR pos1-0 pos1-1 dir-right)
    (MOVE-DIR pos1-1 pos1-0 dir-left)
    (MOVE-DIR pos1-1 pos1-2 dir-right)
    (MOVE-DIR pos1-1 pos2-1 dir-down)
    (MOVE-DIR pos1-1 pos0-1 dir-up)
    (MOVE-DIR pos1-2 pos1-1 dir-left)
    (MOVE-DIR pos1-2 pos1-3 dir-right)
    (MOVE-DIR pos1-3 pos1-2 dir-left)
    (MOVE-DIR pos1-3 pos2-3 dir-down)
    (MOVE-DIR pos1-3 pos0-3 dir-up)
    (MOVE-DIR pos2-1 pos3-1 dir-down)
    (MOVE-DIR pos2-1 pos1-1 dir-up)
    (MOVE-DIR pos2-3 pos3-3 dir-down)
    (MOVE-DIR pos2-3 pos1-3 dir-up)
    (MOVE-DIR pos3-0 pos3-1 dir-right)
    (MOVE-DIR pos3-0 pos4-0 dir-down)
    (MOVE-DIR pos3-1 pos3-0 dir-left)
    (MOVE-DIR pos3-1 pos4-1 dir-down)
    (MOVE-DIR pos3-1 pos2-1 dir-up)
    (MOVE-DIR pos3-3 pos4-3 dir-down)
    (MOVE-DIR pos3-3 pos2-3 dir-up)
    (MOVE-DIR pos4-0 pos3-0 dir-up)
    (MOVE-DIR pos4-0 pos4-1 dir-right)
    (MOVE-DIR pos4-0 pos5-0 dir-down)
    (MOVE-DIR pos4-1 pos4-0 dir-left)
    (MOVE-DIR pos4-1 pos3-1 dir-up)
    (MOVE-DIR pos4-3 pos5-3 dir-down)
    (MOVE-DIR pos4-3 pos3-3 dir-up)
    (MOVE-DIR pos5-0 pos4-0 dir-up)
    (MOVE-DIR pos5-0 pos6-0 dir-down)
    (MOVE-DIR pos5-3 pos6-3 dir-down)
    (MOVE-DIR pos5-3 pos4-3 dir-up)
    (MOVE-DIR pos6-0 pos5-0 dir-up)
    (MOVE-DIR pos6-0 pos6-1 dir-right)
    (MOVE-DIR pos6-1 pos6-0 dir-left)
    (MOVE-DIR pos6-1 pos6-2 dir-right)
    (MOVE-DIR pos6-2 pos6-1 dir-left)
    (MOVE-DIR pos6-2 pos6-3 dir-right)
    (MOVE-DIR pos6-3 pos6-2 dir-left)
    (MOVE-DIR pos6-3 pos5-3 dir-up)
    (thinsnake pos5-0)
    (blocked pos5-0)
    (ispoint pos0-0)
    (ispoint pos0-3)
    (ispoint pos1-1)
    (ispoint pos3-0)
    (ispoint pos4-1)
)
(:goal
(and
    (not (ispoint pos0-0))
    (not (ispoint pos0-3))
    (not (ispoint pos1-1))
    (not (ispoint pos3-0))
    (not (ispoint pos4-1))
)
)
)

; plan
1. (move-thin-snake pos5-0 pos6-0 dir-down)
   deleted: (thinsnake pos5-0) (blocked pos5-0)
   added: (thinsnake pos6-0) (blocked pos6-0)
   goals met: 0 of 5
2. (move-thin-snake pos6-0 pos6-1 dir-right)
   deleted: (thinsnake pos6-0) (blocked pos6-0)
   added: (thinsnake pos6-1) (blocked pos6-1)
   goals met: 0 of 5
3. (move-thin-snake pos6-1 pos6-2 dir-right)
   deleted: (thinsnake pos6-1) (blocked pos6-1)
   added: (thinsnake pos6-2) (blocked pos6-2)
   goals met: 0 of 5
4. (move-thin-snake pos6-2 pos6-3 dir-right)
   deleted: (thinsnake pos6-2) (blocked pos6-2)
   added: (thinsnake pos6-3) (blocked pos6-3)
   goals met: 0 of 5
5. (move-thin-snake pos6-3 pos5-3 dir-up)
   deleted: (thinsnake pos6-3) (blocked pos6-3)
   added: (thinsnake pos5-3) (blocked pos5-3)
   goals met: 0 of 5
6. (move-thin-snake pos5-3 pos4-3 dir-up)
   deleted: (thinsnake pos5-3) (blocked pos5-3)
   added: (thinsnake pos4-3) (blocked pos4-3)
   goals met: 0 of 5
7. (move-thin-snake pos4-3 pos3-3 dir-up)
   deleted: (thinsnake pos4-3) (blocked pos4-3)
   added: (thinsnake pos3-3) (blocked pos3-3)
   goals met: 0 of 5
8. (move-thin-snake pos3-3 pos2-3 dir-up)
   deleted: (thinsnake pos3-3) (blocked pos3-3)
   added: (thinsnake pos2-3) (blocked pos2-3)
   goals met: 0 of 5
9. (move-thin-snake pos2-3 pos1-3 dir-up)
   deleted: (thinsnake pos2-3) (blocked pos2-3)
   added: (thinsnake pos1-3) (blocked pos1-3)
   goals met: 0 of 5
10. (move-thin-snake pos1-3 pos1-2 dir-left)
   deleted: (thinsnake pos1-3) (blocked pos1-3)
   added: (thinsnake pos1-2) (blocked pos1-2)
   goals met: 0 of 5
11. (move-thin-snake-and-first-eat pos1-2 pos1-1 dir-left)
   deleted: (ispoint pos1-1) (thinsnake pos1-2)
   added: (blocked pos1-1) (headsnake pos1-1) (tailsnake pos1-2) (nextsnake pos1-1 pos1-2)
   goals met: 1 of 5
12. (move-fat-snake pos1-1 pos1-0 pos1-2 pos1-1 dir-left)
   deleted: (headsnake pos1-1) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos1-1 pos1-2)
   added: (blocked pos1-0) (headsnake pos1-0) (nextsnake pos1-0 pos1-1) (tailsnake pos1-1)
   goals met: 1 of 5
13. (move-and-eat pos1-0 pos0-0 dir-up)
   deleted: (headsnake pos1-0) (ispoint pos0-0)
   added: (blocked pos0-0) (headsnake pos0-0) (nextsnake pos0-0 pos1-0)
   goals met: 2 of 5
14. (move-fat-snake pos0-0 pos0-1 pos1-1 pos1-0 dir-right)
   deleted: (headsnake pos0-0) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos1-0 pos1-1)
   added: (blocked pos0-1) (headsnake pos0-1) (nextsnake pos0-1 pos0-0) (tailsnake pos1-0)
   goals met: 2 of 5
15. (move-fat-snake pos0-1 pos1-1 pos1-0 pos0-0 dir-down)
   deleted: (headsnake pos0-1) (blocked pos1-0) (tailsnake pos1-0) (nextsnake pos0-0 pos1-0)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos0-1) (tailsnake pos0-0)
   goals met: 2 of 5
16. (move-fat-snake pos1-1 pos2-1 pos0-0 pos0-1 dir-down)
   deleted: (headsnake pos1-1) (blocked pos0-0) (tailsnake pos0-0) (nextsnake pos0-1 pos0-0)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos1-1) (tailsnake pos0-1)
   goals met: 2 of 5
17. (move-fat-snake pos2-1 pos3-1 pos0-1 pos1-1 dir-down)
   deleted: (headsnake pos2-1) (blocked pos0-1) (tailsnake pos0-1) (nextsnake pos1-1 pos0-1)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos2-1) (tailsnake pos1-1)
   goals met: 2 of 5
18. (move-and-eat pos3-1 pos4-1 dir-down)
   deleted: (headsnake pos3-1) (ispoint pos4-1)
   added: (blocked pos4-1) (headsnake pos4-1) (nextsnake pos4-1 pos3-1)
   goals met: 3 of 5
19. (move-fat-snake pos4-1 pos4-0 pos1-1 pos2-1 dir-left)
   deleted: (headsnake pos4-1) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos2-1 pos1-1)
   added: (blocked pos4-0) (headsnake pos4-0) (nextsnake pos4-0 pos4-1) (tailsnake pos2-1)
   goals met: 3 of 5
20. (move-fat-snake pos4-0 pos5-0 pos2-1 pos3-1 dir-down)
   deleted: (headsnake pos4-0) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos3-1 pos2-1)
   added: (blocked pos5-0) (headsnake pos5-0) (nextsnake pos5-0 pos4-0) (tailsnake pos3-1)
   goals met: 3 of 5
21. (move-fat-snake pos5-0 pos6-0 pos3-1 pos4-1 dir-down)
   deleted: (headsnake pos5-0) (blocked pos3-1) (tailsnake pos3-1) (nextsnake pos4-1 pos3-1)
   added: (blocked pos6-0) (headsnake pos6-0) (nextsnake pos6-0 pos5-0) (tailsnake pos4-1)
   goals met: 3 of 5
22. (move-fat-snake pos6-0 pos6-1 pos4-1 pos4-0 dir-right)
   deleted: (headsnake pos6-0) (blocked pos4-1) (tailsnake pos4-1) (nextsnake pos4-0 pos4-1)
   added: (blocked pos6-1) (headsnake pos6-1) (nextsnake pos6-1 pos6-0) (tailsnake pos4-0)
   goals met: 3 of 5
23. (move-fat-snake pos6-1 pos6-2 pos4-0 pos5-0 dir-right)
   deleted: (headsnake pos6-1) (blocked pos4-0) (tailsnake pos4-0) (nextsnake pos5-0 pos4-0)
   added: (blocked pos6-2) (headsnake pos6-2) (nextsnake pos6-2 pos6-1) (tailsnake pos5-0)
   goals met: 3 of 5
24. (move-fat-snake pos6-2 pos6-3 pos5-0 pos6-0 dir-right)
   deleted: (headsnake pos6-2) (blocked pos5-0) (tailsnake pos5-0) (nextsnake pos6-0 pos5-0)
   added: (blocked pos6-3) (headsnake pos6-3) (nextsnake pos6-3 pos6-2) (tailsnake pos6-0)
   goals met: 3 of 5
25. (move-fat-snake pos6-3 pos5-3 pos6-0 pos6-1 dir-up)
   deleted: (headsnake pos6-3) (blocked pos6-0) (tailsnake pos6-0) (nextsnake pos6-1 pos6-0)
   added: (blocked pos5-3) (headsnake pos5-3) (nextsnake pos5-3 pos6-3) (tailsnake pos6-1)
   goals met: 3 of 5
26. (move-fat-snake pos5-3 pos4-3 pos6-1 pos6-2 dir-up)
   deleted: (headsnake pos5-3) (blocked pos6-1) (tailsnake pos6-1) (nextsnake pos6-2 pos6-1)
   added: (blocked pos4-3) (headsnake pos4-3) (nextsnake pos4-3 pos5-3) (tailsnake pos6-2)
   goals met: 3 of 5
27. (move-fat-snake pos4-3 pos3-3 pos6-2 pos6-3 dir-up)
   deleted: (headsnake pos4-3) (blocked pos6-2) (tailsnake pos6-2) (nextsnake pos6-3 pos6-2)
   added: (blocked pos3-3) (headsnake pos3-3) (nextsnake pos3-3 pos4-3) (tailsnake pos6-3)
   goals met: 3 of 5
28. (move-fat-snake pos3-3 pos2-3 pos6-3 pos5-3 dir-up)
   deleted: (headsnake pos3-3) (blocked pos6-3) (tailsnake pos6-3) (nextsnake pos5-3 pos6-3)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos3-3) (tailsnake pos5-3)
   goals met: 3 of 5
29. (move-fat-snake pos2-3 pos1-3 pos5-3 pos4-3 dir-up)
   deleted: (headsnake pos2-3) (blocked pos5-3) (tailsnake pos5-3) (nextsnake pos4-3 pos5-3)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos2-3) (tailsnake pos4-3)
   goals met: 3 of 5
30. (move-fat-snake pos1-3 pos1-2 pos4-3 pos3-3 dir-left)
   deleted: (headsnake pos1-3) (blocked pos4-3) (tailsnake pos4-3) (nextsnake pos3-3 pos4-3)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-3) (tailsnake pos3-3)
   goals met: 3 of 5
31. (move-fat-snake pos1-2 pos1-1 pos3-3 pos2-3 dir-left)
   deleted: (headsnake pos1-2) (blocked pos3-3) (tailsnake pos3-3) (nextsnake pos2-3 pos3-3)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos1-2) (tailsnake pos2-3)
   goals met: 3 of 5
32. (move-fat-snake pos1-1 pos2-1 pos2-3 pos1-3 dir-down)
   deleted: (headsnake pos1-1) (blocked pos2-3) (tailsnake pos2-3) (nextsnake pos1-3 pos2-3)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos1-1) (tailsnake pos1-3)
   goals met: 3 of 5
33. (move-fat-snake pos2-1 pos3-1 pos1-3 pos1-2 dir-down)
   deleted: (headsnake pos2-1) (blocked pos1-3) (tailsnake pos1-3) (nextsnake pos1-2 pos1-3)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos2-1) (tailsnake pos1-2)
   goals met: 3 of 5
34. (move-and-eat pos3-1 pos3-0 dir-left)
   deleted: (headsnake pos3-1) (ispoint pos3-0)
   added: (blocked pos3-0) (headsnake pos3-0) (nextsnake pos3-0 pos3-1)
   goals met: 4 of 5
35. (move-fat-snake pos3-0 pos4-0 pos1-2 pos1-1 dir-down)
   deleted: (headsnake pos3-0) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos1-1 pos1-2)
   added: (blocked pos4-0) (headsnake pos4-0) (nextsnake pos4-0 pos3-0) (tailsnake pos1-1)
   goals met: 4 of 5
36. (move-fat-snake pos4-0 pos5-0 pos1-1 pos2-1 dir-down)
   deleted: (headsnake pos4-0) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos2-1 pos1-1)
   added: (blocked pos5-0) (headsnake pos5-0) (nextsnake pos5-0 pos4-0) (tailsnake pos2-1)
   goals met: 4 of 5
37. (move-fat-snake pos5-0 pos6-0 pos2-1 pos3-1 dir-down)
   deleted: (headsnake pos5-0) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos3-1 pos2-1)
   added: (blocked pos6-0) (headsnake pos6-0) (nextsnake pos6-0 pos5-0) (tailsnake pos3-1)
   goals met: 4 of 5
38. (move-fat-snake pos6-0 pos6-1 pos3-1 pos3-0 dir-right)
   deleted: (headsnake pos6-0) (blocked pos3-1) (tailsnake pos3-1) (nextsnake pos3-0 pos3-1)
   added: (blocked pos6-1) (headsnake pos6-1) (nextsnake pos6-1 pos6-0) (tailsnake pos3-0)
   goals met: 4 of 5
39. (move-fat-snake pos6-1 pos6-2 pos3-0 pos4-0 dir-right)
   deleted: (headsnake pos6-1) (blocked pos3-0) (tailsnake pos3-0) (nextsnake pos4-0 pos3-0)
   added: (blocked pos6-2) (headsnake pos6-2) (nextsnake pos6-2 pos6-1) (tailsnake pos4-0)
   goals met: 4 of 5
40. (move-fat-snake pos6-2 pos6-3 pos4-0 pos5-0 dir-right)
   deleted: (headsnake pos6-2) (blocked pos4-0) (tailsnake pos4-0) (nextsnake pos5-0 pos4-0)
   added: (blocked pos6-3) (headsnake pos6-3) (nextsnake pos6-3 pos6-2) (tailsnake pos5-0)
   goals met: 4 of 5
41. (move-fat-snake pos6-3 pos5-3 pos5-0 pos6-0 dir-up)
   deleted: (headsnake pos6-3) (blocked pos5-0) (tailsnake pos5-0) (nextsnake pos6-0 pos5-0)
   added: (blocked pos5-3) (headsnake pos5-3) (nextsnake pos5-3 pos6-3) (tailsnake pos6-0)
   goals met: 4 of 5
42. (move-fat-snake pos5-3 pos4-3 pos6-0 pos6-1 dir-up)
   deleted: (headsnake pos5-3) (blocked pos6-0) (tailsnake pos6-0) (nextsnake pos6-1 pos6-0)
   added: (blocked pos4-3) (headsnake pos4-3) (nextsnake pos4-3 pos5-3) (tailsnake pos6-1)
   goals met: 4 of 5
43. (move-fat-snake pos4-3 pos3-3 pos6-1 pos6-2 dir-up)
   deleted: (headsnake pos4-3) (blocked pos6-1) (tailsnake pos6-1) (nextsnake pos6-2 pos6-1)
   added: (blocked pos3-3) (headsnake pos3-3) (nextsnake pos3-3 pos4-3) (tailsnake pos6-2)
   goals met: 4 of 5
44. (move-fat-snake pos3-3 pos2-3 pos6-2 pos6-3 dir-up)
   deleted: (headsnake pos3-3) (blocked pos6-2) (tailsnake pos6-2) (nextsnake pos6-3 pos6-2)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos3-3) (tailsnake pos6-3)
   goals met: 4 of 5
45. (move-fat-snake pos2-3 pos1-3 pos6-3 pos5-3 dir-up)
   deleted: (headsnake pos2-3) (blocked pos6-3) (tailsnake pos6-3) (nextsnake pos5-3 pos6-3)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos2-3) (tailsnake pos5-3)
   goals met: 4 of 5
46. (move-and-eat pos1-3 pos0-3 dir-up)
   deleted: (headsnake pos1-3) (ispoint pos0-3)
   added: (blocked pos0-3) (headsnake pos0-3) (nextsnake pos0-3 pos1-3)
   goals met: 5 of 5
